from pprint import pprint
import random
from parts import team_gen, pass_ball, shoot, defence
import pygame


SPEED = 100

score = [0, 0]
ball = 1

# players = json.load(open("players.json"))
# print(players['goalkeepers']['Liam Smith'])
team_1 = None
team_2 = None
k = 0
num = 1
while k != 2:
    q = input(f"Введите имя вратаря для команды {num}: ")
    w = input(f"Введите имя защитника для команды {num}: ")
    e = input(f"Введите имя защитника для команды {num}: ")
    r = input(f"Введите имя защитника для команды {num}: ")
    t = input(f"Введите имя защитника для команды {num}: ")
    y = input(f"Введите имя полузащитника для команды {num}: ")
    u = input(f"Введите имя полузащитника для команды {num}: ")
    i = input(f"Введите имя полузащитника для команды {num}: ")
    o = input(f"Введите имя нападающего для команды {num}: ")
    p = input(f"Введите имя нападающего для команды {num}: ")
    a = input(f"Введите имя нападающего для команды {num}: ")
    if k == 0:
        team_1 = team_gen(q, w, e, r, t, y, u, i, o, p, a)[1]
        team_1_stat = team_gen(q, w, e, r, t, y, u, i, o, p, a)[0]
        team_1[w]["status_ball"] = True
        k += 1
        num += 1
    else:
        team_2 = team_gen(q, w, e, r, t, y, u, i, o, p, a)[1]
        team_2_stat = team_gen(q, w, e, r, t, y, u, i, o, p, a)[0]
        k += 1
print('--------------------------------------------------------------------------')
print("__________________________Команды готовы!________________________________")
print('--------------------------------------------------------------------------')
print('Cocтав команды 1: ')
pprint(team_1)
print('--------------------------------------------------------------------------')
print('Cocтав команды 2: ')
pprint(team_2)
print('--------------------------------------------------------------------------')

def main(ball, team_1, team_2, score):
    pygame.init()
    clock = pygame.time.Clock()
    print('--------------------------------------------------------------------------')
    print("__________________________Игра началась!__________________________________")
    print('--------------------------------------------------------------------------')
    print()
    s = 0
    for i in range(90):
        s =0
        print(f'{i} минута игры')
        z = random.randint(3,6)
        while s!=z:
            a = random.randint(1,100)
            b = random.randint(1,100)
            clock.tick(SPEED)
            pass_ball(ball, team_1, team_2)
            if a<20:
                stat = shoot(ball, team_1, team_2, score)
                ball, score = stat[0], stat[1]
            if b<50:
                ball = defence(ball, team_1, team_2)
            s += 1
        if i == 45:
            print('--------------------------------------------------------------------------')
            print("__________________________Перерыв!_______________________________________")
            print(f"__________________________Счёт: {score[0]} - {score[1]}_______________________________________")
            print('--------------------------------------------------------------------------')
    print('--------------------------------------------------------------------------')
    print("__________________________Игра окончена!__________________________________")
    print(f"_______________________Счёт: {score[0]} - {score[1]}______________________________")
    print('--------------------------------------------------------------------------')

if __name__ == "__main__":
    main(ball, team_1, team_2, score)